# classements badmania

In [1]:
PAGE = 'https://badmania.fr/club-joueurs-2254-riom-badminton-club.html'

In [2]:
import pandas as pd
html_tables = pd.read_html(PAGE)

In [6]:
df_adherents = html_tables[0]
df_adherents.head()

,Nom ▼▲,Nom ▼▲.1,Prénom ▼▲,Prénom ▼▲.1,Sexe,Licence,Catégorie ▼▲,Classement ▼▲,Class.
0,ANDRAL,Anthony,ANDRAL,Anthony,NaN,7354056,Senior,P11/P10/P11,P11/P10/P11
1,AVARGUEZ,Eric,AVARGUEZ,Eric,NaN,6630518,Veteran 6,P11/D9/P10,P11/D9/P10
2,BARBIER DARDARE,Léna,BARBIER...,Léna,NaN,7454028,Minibad,-/-/-,-/-/-
3,BARDEL,Damien,BARDEL,Damien,NaN,7250210,Veteran 1,P12/P12/P11,P12/P12/P11
4,BEAUCHENE,Romain,BEAUCHENE,Romain,NaN,6936697,Veteran 1,P12/P12/P12,P12/P12/P12

In [7]:
df_adherents.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96 entries, 0 to 95
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Nom ▼▲         96 non-null     object
 1   Nom ▼▲.1       96 non-null     object
 2   Prénom ▼▲      96 non-null     object
 3   Prénom ▼▲.1    96 non-null     object
 4   Sexe           0 non-null      float64
 5   Licence        96 non-null     int64
 6   Catégorie ▼▲   93 non-null     object
 7   Classement ▼▲  96 non-null     object
 8   Class.         96 non-null     object
dtypes: float64(1), int64(1), object(7)
memory usage: 6.9+ KB

# get_classement

In [20]:
def get_classement(
    license_number,# le numero de license
):
    return df_adherents[df_adherents['Licence'] == license_number]['Class.'].values[0]

In [21]:
get_classement(7354056)

'P11/P10/P11'

# adherents fournis par le bureau

In [22]:
fichier_adherents = 'xls633be4e053e80.xlsx'